axfnull/N32G003_CodeLib/projects/n32g003_EVAL/examples/SPI/SPI_INT_Slave/inc/bsp_spi_slave.h
/**
*     Copyright (c) 2022, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file      bsp_spi_slave.h
*\*\author    Nations
*\*\version   v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved. 
*/
#ifndef __BSP_SPI_SLAVE_H__
#define __BSP_SPI_SLAVE_H__

#ifdef __cplusplus
extern "C" {
#endif
	
#include "n32g003.h"
	
typedef enum
{
    FAILED = 0,
    PASSED = !FAILED
}TestStatus;

/* SPI Macro define */
#define SPI_SLAVE                    SPI
#define SPI_SLAVE_PERIPH             RCC_APB_PERIPH_SPI

/* SPI_NSS Macro define */
#define SPI_SLAVE_NSS_GPIO           GPIOA
#define SPI_SLAVE_NSS_CLK            RCC_APB_PERIPH_IOPA
#define SPI_SLAVE_NSS_PIN            GPIO_PIN_3
#define SPI_SLAVE_NSS_AF             GPIO_AF0_SPI

/* SPI_SCK Macro define */
#define SPI_SLAVE_SCK_GPIO           GPIOA
#define SPI_SLAVE_SCK_CLK            RCC_APB_PERIPH_IOPA
#define SPI_SLAVE_SCK_PIN            GPIO_PIN_15
#define SPI_SLAVE_SCK_AF             GPIO_AF0_SPI

/* SPI_MISO Macro define */
#define SPI_SLAVE_MISO_GPIO          GPIOA
#define SPI_SLAVE_MISO_CLK           RCC_APB_PERIPH_IOPA
#define SPI_SLAVE_MISO_PIN           GPIO_PIN_7
#define SPI_SLAVE_MISO_AF            GPIO_AF0_SPI

/* SPI_MOSI Macro define */
#define SPI_SLAVE_MOSI_GPIO          GPIOA
#define SPI_SLAVE_MOSI_CLK           RCC_APB_PERIPH_IOPA
#define SPI_SLAVE_MOSI_PIN           GPIO_PIN_6
#define SPI_SLAVE_MOSI_AF            GPIO_AF0_SPI

	
void SPI_Configuration(void);
	
#ifdef __cplusplus
}
#endif

#endif /* __BSP_SPI_SLAVE_H__ */

